1 sac
2 linux
3 pick
4 python
5 jupyter
6 fortran
7 obspy
8 rdseed
9 mseed
10 MoPaD
11 电脑性能
12 
13 





															      <1> sac
######################################################################################################################################
1. 保存成ASCII
   r *.sac
   w alpha cs
2.  saclst stla stlo f ANKG.SN.z
3. 震相拾取 ：read file
              ppk;按下t0-t9
              q退出
              wh保存
 4. 删除拾取的震相：ch t0 -12345  其实就是将原本的时间改为无意义的-12345,好像不能一下改多个。
 
 
  															     <2>linux
######################################################################################################################################
1. 查看大文件
   cat 00.txt | more
   或者直接用more
   回车：看下一行  空格：翻页 b：回滚 /：搜索 q：退出
2. 输出结果重定向
   ls > ~/00/a.txt  #是把输出转向到指定的文件，如文件已存在的话也会重新写入，文件原内容不会保留
   ls >> ~/00/a.txt #是把输出附向到文件的后面，文件原内容会保留下来

3. 登录李君师兄虚拟机
   ssh junlysky@10.7.251.16   autocap
   cd /mnt/bashi_fs/sac_data 
   
4. 上传文件到虚拟机：
   scp /home/zhangzhipeng/11/mulprocess1.py junlysky@10.7.251.16:/mnt/bashi_fs/sac_data
   #固定名字               #本机文件              #服务器位置
   出错：Permission denied
   服务器位置没有权限，用ls -lh 可以查看，可以用别的方法修改
   最后发现在bashi_fs目录下有权限，所以
   scp /home/zhangzhipeng/11/mulprocess1.py junlysky@10.7.251.16:/mnt/bashi_fs
   上传目录到虚拟机：
   scp -r /home/zhangzhipeng/11 junlysky@10.7.251.16:/mnt/bashi_fs
4.1 激活环境，运行某个程序
   conda info -e  ：查看conda安装的环境，显示为tf
   conda activate tf :激活conda环境
   python mulprocess1.py :运行程序
   
   
5. 删除一个文件：
   rm test.py
   删除一个目录：
   rm  -rf test
   #   recursion f(不要询问，直接删除)
   
6. 移动一个文件
   mv 00.py /software
   
7. 重命名一个文件：
   mv 00.py 11.py
   
   #ef2929
   
   
   															      <3>pick
######################################################################################################################################
1. ./picker_func_test 2019.168.14.52.59.0000.SC.HMS.00.BHZ.D.SAC test 


														             <4>python
######################################################################################################################################
1. 安装工具包：(1)先用最简单的方法  pip install obspy
2. 查看所有包: pip list
3. 查看某个包: pip show obspy


															    <5>jupyter
######################################################################################################################################
1. 运行: jupyter notebook
2. 退出: Ctrl+c



######################################fk刚安装后的测试
./fk.pl -Mhk/15/k -N512/0.2 -S2 05 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 85 90 95 100 105 110 115 120 125 130 135 140 145 150 155 160 165 170 175 180 185 190 195 200 205 210 215 220 225 230 235 240 245 250 255 260 265 270 275 280 285 290 295 300 305 310 315 320 325 330 335 340 345 350 355 360 365 370 375 380 385 390 395 400 405 410 415

./fk.pl -Mhk/15/k -N512/0.2 -S0 05 10 15 20 25 30 35 40 45 50 55 60 65 70 75 80 85 90 95 100 105 110 115 120 125 130 135 140 145 150 155 160 165 170 175 180 185 190 195 200 205 210 215 220 225 230 235 240 245 250 255 260 265 270 275 280 285 290 295 300 305 310 315 320 325 330 335 340 345 350 355 360 365 370 375 380 385 390 395 400 405 410 415

######################################gcap刚安装的测试
cap.pl -H0.2 -P0.3 -S2/5/0 -T35/70 -F -D2/1/0.5 -C0.05/0.3/0.02/0.1 -W1 -X10 -Mhk_15/5.0 20080418093700


######################################李君师兄gcap参数
cap.pl  -C0.05/0.16/0.05/0.08 -D1.2/0.8/0.2 -F -L0.6 -H0.05 -I10/0.1 -J0./0./0./0 -S5/10/0 -T30/70 -Mcn_2/3.9  -X0 -R0/360/0/90/-180/180 -P0.3 20090215211357
                                                                                                                                #这个P是非常重要的 另外地震事件名称要写道最后
#gcap批量反演  模型_深度/震级 事件(gmt时间)  最大反演深度 深度间隔
./run_gcap.pl cn_1/3.0 20091025110411 30 1


														            <6>fortran
######################################################################################################################################
1. gfortran mec2tensor.f90 -o mec2tens  #编译运行fortran程序
2. 根据FM计算矩张量和PBT轴 ：在software/mec2tensor/mec2ten/src目录下直接运行mec2tens程序
   需要：一个输入文件，名称为mecin.dat 格式为:103.286	30.362  131     51      36      5.79    3
                                           #    lon       lat   strike  dip      rake    Mw     depth
   输出为：  mec2ten.out，格式为：输出文件中有写。      
   
   
                                                              								    <7> <obspy>   
######################################################################################################################################
1 运行一个obspy： python3 summary.py


               						      								    <8> rdseed
######################################################################################################################################
#将seed数据转换成sac(没有加入环境变量之前)
./rdseed.rh6.linux_64 -df 20180911*
#加入环境变量之后
1 rdseed -df 2018* -q ~/test #-d代表数据，-R代表response。 q代表输出的目录。
2 rdseed -h                  #查看帮助选项
3 rdseed -d -o 4 -f xxx.seed #转换成miniseed数据格式

                                                             								      <9>mseed
######################################################################################################################################
1 mseed2sac SC.HWS.00.BHZ.20190617000003.mseed #直接用就行了啊

                                                              								     <10>MoPaD
######################################################################################################################################
0 zhangzhipeng@zhangzhipeng-Inspiron-N4050:~/software/MoPaD  #执行MOpad程序所用目录：（在这个目录下运行）

命令为：（走向，倾角和滑动角）
1  python -m mopad describe 131,51,36 -o USE 
2  Python -m mopad describe 131,51,36 #没有后面的-o 表示默认是NED坐标系
#注意矩张量后面有个 x1 或者是 x10 
3  python -m mopad describe 0.575,0.295,-0.87,0.426,0.304,0.372 -i USE
 # 根据USE坐标系下的矩张量，得到NED坐标系下的矩张量以及2个界面的断层参数
4 python -m mopad describe -h #查看帮助选项
5 python -m mopad decompose -0.752,0.837,-0.045,-0.576 ,-0.183,0.012 -i NED -o NED -p iso_perc,dc_perc,clvd_perc
  #矩张量分解， -i输入格式是NED，-o输出格式也是NED      -p只输出一部分，后面是需要输出的，iso，dc，clvd的比例

															  <11>电脑性能
######################################################################################################################################
1 查看CPU是几核的
  cat /proc/cpuinfo 
  看processor的数字，从0开始，最后是3,说明是4核
2 




